adamantium
Affleck
Akins
Akira
Albertson
Alexandre
Allport
Amblin
Amblinesque
Andersson
Andie
Andromolek
Andrzej
animatronic
Anya
Aquaman
Arapahoe
Argento
Argentoesque
Arkin
Arliss
Arozamena
Arrebato
Astin
Aykroyd
Ayres
Barbro
Barkeresque
Barthelmess
Bava
Beetz
Behling
Bening
Bickford
Bigelow
Birger
Blissfield
Blom
Blondell
Bo
Bodhi
Boetticher
Bogdanovich
Boop
Brolin
Budd
Buechler
Burdette
Busey
Calleia
cartoonishly
Castelnuovo
Cho
Chucky
Claes
cliffside
Coburn
Colman
Connell
Conroy
Coogan
Corman
Coscarelli
Cosell
Cosmatos
Coulson
Crampton
Cranham
Cranston
Cronenberg
Crothers
Culkin
Cumberbatch
Cusack
Dahlbeck
Dalley
Damita
Dardado
Darek
Darkseid
Darrieux
Deadpool
Deathdream
Dennison
Divoff
Dolemite
Donlevy
doofus
doofuses
Dormammu
Dourif
Downey
Dozenesque
Drax
Duchesne
Dudikoff
Dupieux
Durkin
Eisenberg
Ekberg
Ekborg
Eklund
Eline
Elseworlds
Eraserhead
esque
Essoe
Euronymous
Eurosleaze
Ewan
extradimensional
eyeholes
Fabio
facto
Farentino
Fassbender
Ferrara
Flavia
Forsythe
Franciscus
Fredrik
frontman
fu
Fulci
Gadot
Gardoni
Gariazzo
Garris
Gatiss
Gazzara
Gerrit
gialli
giallo
Gibboney
Gilliamesque
Gillis
Godden
Goodfellas
Goreman
Goudal
Gough
Grayskull
Grier
grindhouse
Grissmer
Griswold
Groot
Guadagnino
Guignol
Gwenn
Gwyneth
Gyllenhaal
Hamatsu
Hammeresque
Haneke
harkens
Harker
Hawksian
Heigl
Hellraiser
Helsing
Henenlotter
Henning
Hermione
hijinks
Hillcrists
Hirsch
Hitchcockian
Hodder
Holger
Holliday
Holmwood
Hoopersville
Hopalong
Hoppy
Horshak
Hutt
Hy
Inga
Ingmar
Itt
Jabba
Jackman
Jens
Jetta
Joanou
jones
Jory
Joston
Kabal
Kaecilius
Kal
Kaneto
Kanter
Karswell
Keanu
Keyes
Khota
Kiefer
Kitamura
Kneale
Kohnert
Kollberg
Kolstad
Kostanski
Krampus
Kryptonian
Kulle
kung
Kung
Kuppens
Kwai
Lamberto
Larussa
Lasser
Laudenbach
Lawford
Lazenby
Lecter
Leder
Lemmon
Lensherr
Lili
Liquidatzia
Lithgow
Lorber
Loy
Luca
Lumsden
Lund
Lupita
Luthor
Lynchian
Macabro
machina
Madchester
Maggart
Malcom
Malden
Malick
Malmsten
Mastorakis
Meloni
Mendelsohn
Michaelis
Midler
Mikkelsen
Mina
Mingand
Mitchum
Mondo
Monika
Monroesque
Moorhead
Morell
Mortem
Mortensen
Munn
Murawski
Musante
Mykonos
Nagel
Najimy
narratively
Necronomicon
Needham
Neeson
Nekromantik
Niall
Nico
Nightbreed
Nightcrawler
Nino
Niro
noir
noirs
Noomi
Novak
nunsploitation
Nyqvist
oaters
Odenkirk
Odinism
Oland
onesie
Onibaba
Osment
paddleboat
paintballers
Palance
Palillo
Paltrow
Pappas
partiers
partygoers
Paulson
Paycock
Pesce
Pietari
Plante
Plummer
pre
prima
Pyke
Quaid
Quantico
Quatermass
Raimi
Rapace
rapey
Ratner
reacclimating
reimagines
reimagining
Renfield
Rennie
retcons
rewatch
Riseborough
Ritchie
Rodd
Roddy
Rogell
romcom
Rothe
Runyonesque
Sadler
Samberg
Sarandon
Savini
Scarface
Scatman
scrapbooking
Scrimm
Scrooged
Seagal
Seberg
Segal
sequiturs
Sheehan
Shindô
Shyamalan
Siemaszko
Signy
Silverman
Skeets
Skelly
Smalley
Soavi
softcore
Sorel
Sorkinesque
Spacek
spasming
Stanwyck
Statham
Stig
storylines
Summerisle
supermodelesque
Suspiria
Svedlund
Svenson
Swayze
Swinton
Sydow
Takayuki
takedown
Tasya
telecine
telepath
teleporting
Thom
Thunderdome
Tilda
Tilly
Tobe
Tsarist
Ultron
unengaging
unibrow
unidealized
upconverted
vampiric
Vespa
Viggo
Vogler
von
Voorhees
Vos
vu
Wasikowska
Watchlist
Webber
Wes
Whedon
Winslow
Woolsey
workprint
Wray
Xperiment
Yamamoto
Yasmani
Yuzna
Zack
Zazie
Zbigniew
Zendaya
Zerner
Zetterling
Zimmer
Zito
Zod
Zulueta