adamantium
Affleck
Akins
Akira
Albertson
Allport
animatronic
Anya
Aquaman
Arapahoe
Argento
Argentoesque
Arozamena
Aykroyd
Ayres
Barbro
Barthelmess
Bava
Beetz
Behling
Bening
Bickford
Birger
Blom
Blondell
Boetticher
Bogdanovich
Boop
Brolin
Budd
Burdette
Calleia
cartoonishly
Castelnuovo
Chucky
Claes
cliffside
Coburn
Connell
Conroy
Corman
Coscarelli
Cosmatos
Coulson
Cranham
Cranston
Cronenberg
Cumberbatch
Damita
Darkseid
Darrieux
Deadpool
Dennison
Donlevy
Dormammu
Downey
Dozenesque
Drax
Dupieux
Eisenberg
Ekberg
Eklund
Eline
Elseworlds
Essoe
extradimensional
eyeholes
Fabio
facto
Fassbender
Ferrara
Flavia
Franciscus
Fulci
Gadot
Gardoni
Gariazzo
Gatiss
gialli
giallo
Gibboney
Gilliamesque
Gough
Grayskull
grindhouse
Griswold
Groot
Guignol
Gwenn
Gyllenhaal
Hamatsu
Hammeresque
Haneke
harkens
Harker
Hawksian
Hellraiser
Helsing
Henning
Hermione
Hillcrists
Holger
Holliday
Holmwood
Hoopersville
Hopalong
Hoppy
Hutt
Hy
Inga
Ingmar
Jabba
Jackman
Jens
Jory
Joston
Kaecilius
Kaneto
Karswell
Khota
Kneale
Kollberg
Krampus
Kryptonian
Kuppens
Kwai
Lamberto
Larussa
Lasser
Laudenbach
Lawford
Lazenby
Lecter
Lensherr
Lili
Liquidatzia
Lorber
Loy
Lumsden
Lund
Lupita
Luthor
Lynchian
Macabro
Maggart
Malden
Malmsten
Mastorakis
Mendelsohn
Michaelis
Midler
Mikkelsen
Mina
Mingand
Mitchum
Mondo
Moorhead
Morell
Mortensen
Musante
Mykonos
Nagel
Najimy
narratively
Nekromantik
Niall
Nico
Nightbreed
Nightcrawler
Nino
Niro
Noomi
nunsploitation
Nyqvist
oaters
Oland
onesie
Onibaba
Palance
partiers
partygoers
Paulson
Paycock
Pesce
Pietari
Plante
Plummer
pre
Pyke
Quaid
Quatermass
Raimi
Rapace
rapey
Ratner
reacclimating
reimagines
Renfield
retcons
rewatch
Roddy
romcom
Rothe
Runyonesque
Sarandon
Savini
Scarface
scrapbooking
Scrimm
Seberg
sequiturs
Sheehan
Shindô
Shyamalan
Skeets
Skelly
Soavi
softcore
Sorel
spasming
Stanwyck
Stig
Summerisle
supermodelesque
Svedlund
Swinton
Takayuki
takedown
telecine
telepath
teleporting
Tilda
Tobe
Tsarist
Ultron
unengaging
unidealized
vampiric
Viggo
vu
Wasikowska
Whedon
Woolsey
workprint
Wray
Xperiment
Yamamoto
Yasmani
Zack
Zazie
Zerner
Zetterling
Zimmer
Zito
Zod