adamantium
Affleck
Akins
Akira
Albertson
Alexandre
Allport
Amblin
Amblinesque
Andersson
Andie
animatronic
Anya
Aquaman
Arapahoe
Argento
Argentoesque
Arozamena
Astin
Aykroyd
Ayres
Barbro
Barthelmess
Bava
Beetz
Behling
Bening
Bickford
Birger
Blom
Blondell
Boetticher
Bogdanovich
Boop
Brolin
Budd
Buechler
Burdette
Calleia
cartoonishly
Castelnuovo
Chucky
Claes
cliffside
Coburn
Colman
Connell
Conroy
Corman
Coscarelli
Cosmatos
Coulson
Cranham
Cranston
Cronenberg
Crothers
Cumberbatch
Dahlbeck
Damita
Dardado
Darkseid
Darrieux
Deadpool
Dennison
Dolemite
Donlevy
doofus
doofuses
Dormammu
Dourif
Downey
Dozenesque
Drax
Dudikoff
Dupieux
Durkin
Eisenberg
Ekberg
Ekborg
Eklund
Eline
Elseworlds
Essoe
extradimensional
eyeholes
Fabio
facto
Fassbender
Ferrara
Flavia
Franciscus
Fredrik
Fulci
Gadot
Gardoni
Gariazzo
Gatiss
gialli
giallo
Gibboney
Gilliamesque
Goreman
Gough
Grayskull
grindhouse
Griswold
Groot
Guignol
Gwenn
Gyllenhaal
Hamatsu
Hammeresque
Haneke
harkens
Harker
Hawksian
Heigl
Hellraiser
Helsing
Henning
Hermione
Hillcrists
Hitchcockian
Hodder
Holger
Holliday
Holmwood
Hoopersville
Hopalong
Hoppy
Horshak
Hutt
Hy
Inga
Ingmar
Itt
Jabba
Jackman
Jens
Joanou
Jory
Joston
Kabal
Kaecilius
Kaneto
Karswell
Keanu
Khota
Kneale
Kollberg
Kostanski
Krampus
Kryptonian
Kulle
Kung
Kuppens
Kwai
Lamberto
Larussa
Lasser
Laudenbach
Lawford
Lazenby
Lecter
Lensherr
Lili
Liquidatzia
Lorber
Loy
Lumsden
Lund
Lupita
Luthor
Lynchian
Macabro
machina
Maggart
Malcom
Malden
Malmsten
Mastorakis
Mendelsohn
Michaelis
Midler
Mikkelsen
Mina
Mingand
Mitchum
Mondo
Monika
Moorhead
Morell
Mortensen
Murawski
Musante
Mykonos
Nagel
Najimy
narratively
Nekromantik
Niall
Nico
Nightbreed
Nightcrawler
Nino
Niro
noir
Noomi
nunsploitation
Nyqvist
oaters
Oland
onesie
Onibaba
Osment
paintballers
Palance
Palillo
partiers
partygoers
Paulson
Paycock
Pesce
Pietari
Plante
Plummer
pre
prima
Pyke
Quaid
Quatermass
Raimi
Rapace
rapey
Ratner
reacclimating
reimagines
Renfield
retcons
rewatch
Roddy
romcom
Rothe
Runyonesque
Sadler
Sarandon
Savini
Scarface
Scatman
scrapbooking
Scrimm
Scrooged
Seberg
Segal
sequiturs
Sheehan
Shindô
Shyamalan
Siemaszko
Silverman
Skeets
Skelly
Smalley
Soavi
softcore
Sorel
spasming
Stanwyck
Stig
storylines
Summerisle
supermodelesque
Svedlund
Swinton
Takayuki
takedown
telecine
telepath
teleporting
Thom
Tilda
Tilly
Tobe
Tsarist
Ultron
unengaging
unidealized
vampiric
Vespa
Viggo
vu
Wasikowska
Watchlist
Webber
Wes
Whedon
Winslow
Woolsey
workprint
Wray
Xperiment
Yamamoto
Yasmani
Zack
Zazie
Zerner
Zetterling
Zimmer
Zito
Zod