adamantium
Affleck
Akins
Akira
Albertson
Alexandre
Allport
Amblin
Amblinesque
Andersson
Andie
Andrzej
animatronic
Anya
Aquaman
Arapahoe
Argento
Argentoesque
Arliss
Arozamena
Arrebato
Astin
Aykroyd
Ayres
Barbro
Barthelmess
Bava
Beetz
Behling
Bening
Bickford
Birger
Blom
Blondell
Boetticher
Bogdanovich
Boop
Brolin
Budd
Buechler
Burdette
Calleia
cartoonishly
Castelnuovo
Cho
Chucky
Claes
cliffside
Coburn
Colman
Connell
Conroy
Coogan
Corman
Coscarelli
Cosell
Cosmatos
Coulson
Crampton
Cranham
Cranston
Cronenberg
Crothers
Cumberbatch
Cusack
Dahlbeck
Damita
Dardado
Darek
Darkseid
Darrieux
Deadpool
Dennison
Dolemite
Donlevy
doofus
doofuses
Dormammu
Dourif
Downey
Dozenesque
Drax
Dudikoff
Dupieux
Durkin
Eisenberg
Ekberg
Ekborg
Eklund
Eline
Elseworlds
Essoe
extradimensional
eyeholes
Fabio
facto
Fassbender
Ferrara
Flavia
Franciscus
Fredrik
fu
Fulci
Gadot
Gardoni
Gariazzo
Gatiss
Gazzara
gialli
giallo
Gibboney
Gilliamesque
Goreman
Goudal
Gough
Grayskull
grindhouse
Grissmer
Griswold
Groot
Guadagnino
Guignol
Gwenn
Gwyneth
Gyllenhaal
Hamatsu
Hammeresque
Haneke
harkens
Harker
Hawksian
Heigl
Hellraiser
Helsing
Henning
Hermione
hijinks
Hillcrists
Hitchcockian
Hodder
Holger
Holliday
Holmwood
Hoopersville
Hopalong
Hoppy
Horshak
Hutt
Hy
Inga
Ingmar
Itt
Jabba
Jackman
Jens
Jetta
Joanou
Jory
Joston
Kabal
Kaecilius
Kal
Kaneto
Karswell
Keanu
Khota
Kiefer
Kitamura
Kneale
Kollberg
Kolstad
Kostanski
Krampus
Kryptonian
Kulle
kung
Kung
Kuppens
Kwai
Lamberto
Larussa
Lasser
Laudenbach
Lawford
Lazenby
Lecter
Lemmon
Lensherr
Lili
Liquidatzia
Lithgow
Lorber
Loy
Luca
Lumsden
Lund
Lupita
Luthor
Lynchian
Macabro
machina
Madchester
Maggart
Malcom
Malden
Malmsten
Mastorakis
Meloni
Mendelsohn
Michaelis
Midler
Mikkelsen
Mina
Mingand
Mitchum
Mondo
Monika
Monroesque
Moorhead
Morell
Mortensen
Murawski
Musante
Mykonos
Nagel
Najimy
narratively
Neeson
Nekromantik
Niall
Nico
Nightbreed
Nightcrawler
Nino
Niro
noir
Noomi
Novak
nunsploitation
Nyqvist
oaters
Odenkirk
Oland
onesie
Onibaba
Osment
paddleboat
paintballers
Palance
Palillo
Paltrow
partiers
partygoers
Paulson
Paycock
Pesce
Pietari
Plante
Plummer
pre
prima
Pyke
Quaid
Quatermass
Raimi
Rapace
rapey
Ratner
reacclimating
reimagines
Renfield
Rennie
retcons
rewatch
Riseborough
Ritchie
Roddy
romcom
Rothe
Runyonesque
Sadler
Samberg
Sarandon
Savini
Scarface
Scatman
scrapbooking
Scrimm
Scrooged
Seagal
Seberg
Segal
sequiturs
Sheehan
Shindô
Shyamalan
Siemaszko
Silverman
Skeets
Skelly
Smalley
Soavi
softcore
Sorel
Spacek
spasming
Stanwyck
Statham
Stig
storylines
Summerisle
supermodelesque
Suspiria
Svedlund
Swayze
Swinton
Takayuki
takedown
Tasya
telecine
telepath
teleporting
Thom
Tilda
Tilly
Tobe
Tsarist
Ultron
unengaging
unibrow
unidealized
vampiric
Vespa
Viggo
Vos
vu
Wasikowska
Watchlist
Webber
Wes
Whedon
Winslow
Woolsey
workprint
Wray
Xperiment
Yamamoto
Yasmani
Zack
Zazie
Zerner
Zetterling
Zimmer
Zito
Zod
Zulueta